<a href="https://colab.research.google.com/github/SEJUNTONY/Data_Science_Class/blob/minkyu/%EC%B2%AD%EB%AC%BC%ED%8F%AC%20%EB%8D%B0%EC%82%AC.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import numpy as np
import pandas as pd
pd.__version__

'1.1.5'

In [5]:
s1 = pd.Series([0, 0.25, 0.5, 0.75, 1.0])
s1

0    0.00
1    0.25
2    0.50
3    0.75
4    1.00
dtype: float64

In [7]:
s1.values

array([0.  , 0.25, 0.5 , 0.75, 1.  ])

In [8]:
s1.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
s1[1]

0.25

In [10]:
s2 = pd.Series([0,0.25,0.5,0.75,1],index=['a','b','c','d','e'])
s2

a    0.00
b    0.25
c    0.50
d    0.75
e    1.00
dtype: float64

In [11]:
s2['c']

0.5

In [12]:
'b' in s2

True

In [13]:
s3 = pd.Series(['정은지','지수빈','정주희','박세준','정찬호'],index=['하나','둘','셋','넷','다섯'], name='출석부')
s3

하나    정은지
둘     지수빈
셋     정주희
넷     박세준
다섯    정찬호
Name: 출석부, dtype: object

In [14]:
s3.unique()

array(['정은지', '지수빈', '정주희', '박세준', '정찬호'], dtype=object)

In [15]:
s3 == '정찬호'

하나    False
둘     False
셋     False
넷     False
다섯     True
Name: 출석부, dtype: bool

In [16]:
pop_tuple = {'서울특별시':9720846,
             '부산광역시':3404423,
             '인천광역시':2947217,
             '대구광역시':2427954,
             '대전광역시':1471040,
             '광주광역시':1455048}
population = pd.Series(pop_tuple)
population

서울특별시    9720846
부산광역시    3404423
인천광역시    2947217
대구광역시    2427954
대전광역시    1471040
광주광역시    1455048
dtype: int64

In [17]:
pd.DataFrame([{'A' :2, 'B' : 4, 'D' : 3},{'A':4, 'B':5, 'C':7}])

   A  B    D    C
0  2  4  3.0  NaN
1  4  5  NaN  7.0

In [18]:
pd.DataFrame(np.random.rand(5,5),
             columns=['A','B','C','D','E'],
             index=[1,2,3,4,5])

          A         B         C         D         E
1  0.591224  0.742736  0.806572  0.275439  0.690643
2  0.921623  0.143290  0.782361  0.791938  0.916324
3  0.374238  0.501974  0.577887  0.128137  0.537997
4  0.288092  0.662288  0.822294  0.607900  0.269820
5  0.415687  0.855660  0.391017  0.288317  0.836676

In [19]:
male_tuple = {'서울특별시':4732275,
             '부산광역시':1668618,
             '인천광역시':1476813,
             '대구광역시':1198815,
             '대전광역시':734441,
             '광주광역시':720060}
male = pd.Series(male_tuple)
male

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
dtype: int64

In [20]:
female_tuple = {'서울특별시':4988571,
             '부산광역시':1735805,
             '인천광역시':1470404,
             '대구광역시':1229139,
             '대전광역시':736599,
             '광주광역시':734988}
female = pd.Series(female_tuple)
female

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736599
광주광역시     734988
dtype: int64

In [21]:
korea_df = pd.DataFrame({'인구수':population,
                        '남자인구수' : male,
                         '여자인구수' : female})
korea_df

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3404423  1668618  1735805
인천광역시  2947217  1476813  1470404
대구광역시  2427954  1198815  1229139
대전광역시  1471040   734441   736599
광주광역시  1455048   720060   734988

In [22]:
korea_df['여자인구수']

서울특별시    4988571
부산광역시    1735805
인천광역시    1470404
대구광역시    1229139
대전광역시     736599
광주광역시     734988
Name: 여자인구수, dtype: int64

In [24]:
korea_df['서울특별시':'대전광역시']

           인구수    남자인구수    여자인구수
서울특별시  9720846  4732275  4988571
부산광역시  3404423  1668618  1735805
인천광역시  2947217  1476813  1470404
대구광역시  2427954  1198815  1229139
대전광역시  1471040   734441   736599

In [25]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [26]:
filename = '/content/drive/MyDrive/부산항_2021.csv'

seadata2 = pd.read_csv(filename)
seadata2.head()

         출항        입항     외항 입항     외항 출항    외국선 입항    외국선 출항   국적선 입항   국적선 출항
0  18374306  16379285  16379285  18374306  30780481  14548165  1831120  2141990
1  17033243  14618183  14618183  17033243  27694240  12701895  1916288  2040898
2  19721734  17151498  17151498  19721734  32538031  14886176  2265322  2069879
3  18356391  18266865  18266865  18356391  32305352  16173092  2093773  2224131
4  19652544  17507307  17507307  19652544  32795440  15500336  2006971  2357440

In [28]:
seadata2.shape

(7, 8)

In [29]:
seadata2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   출항      7 non-null      int64
 1   입항      7 non-null      int64
 2   외항 입항   7 non-null      int64
 3   외항 출항   7 non-null      int64
 4   외국선 입항  7 non-null      int64
 5   외국선 출항  7 non-null      int64
 6   국적선 입항  7 non-null      int64
 7   국적선 출항  7 non-null      int64
dtypes: int64(8)
memory usage: 576.0 bytes

In [30]:
seadata2.describe()

                 출항            입항  ...        국적선 입항        국적선 출항
count  7.000000e+00  7.000000e+00  ...  7.000000e+00  7.000000e+00
mean   1.876015e+07  1.702029e+07  ...  2.074419e+06  2.191097e+06
std    9.419427e+05  1.208136e+06  ...  1.920402e+05  1.973596e+05
min    1.703324e+07  1.461818e+07  ...  1.831120e+06  1.970656e+06
25%    1.836535e+07  1.676539e+07  ...  1.961630e+06  2.055388e+06
50%    1.888054e+07  1.741710e+07  ...  2.027284e+06  2.141990e+06
75%    1.947742e+07  1.765455e+07  ...  2.179548e+06  2.290786e+06
max    1.972173e+07  1.826686e+07  ...  2.380176e+06  2.532688e+06

[8 rows x 8 columns]

In [31]:
seadata2['출항']

0    18374306
1    17033243
2    19721734
3    18356391
4    19652544
5    18880543
6    19302300
Name: 출항, dtype: int64

In [32]:
seadata2['출항'].describe()

count    7.000000e+00
mean     1.876015e+07
std      9.419427e+05
min      1.703324e+07
25%      1.836535e+07
50%      1.888054e+07
75%      1.947742e+07
max      1.972173e+07
Name: 출항, dtype: float64